flimmy78/MXN003_FACTORY/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/freertos_mxn003/main.c
/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    switch (p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
            NRF_LOG_INFO("Connected to a previously bonded device.\r\n");
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            NRF_LOG_INFO("Connection secured. Role: %d. conn_handle: %d, Procedure: %d\r\n",
                         ble_conn_state_role(p_evt->conn_handle),
                         p_evt->conn_handle,
                         p_evt->params.conn_sec_succeeded.procedure);
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
            /* Often, when securing fails, it shouldn't be restarted, for security reasons.
             * Other times, it can be restarted directly.
             * Sometimes it can be restarted, but only after changing some Security Parameters.
             * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
             * Sometimes it is impossible, to secure the link, or the peer device does not support it.
             * How to handle this error is highly application dependent. */
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            // Reject pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

        case PM_EVT_STORAGE_FULL:
        {
            // Run garbage collection on the flash.
            err_code = fds_gc();
            if (err_code == FDS_ERR_BUSY || err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                // Retry.
            }
            else
            {
                APP_ERROR_CHECK(err_code);
            }
        } break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {
            advertising_start();
        } break;

        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
        {
            // The local database has likely changed, send service changed indications.
            pm_local_database_has_changed();
        } break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_data_update_failed.error);
        } break;

        case PM_EVT_PEER_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
        } break;

        case PM_EVT_PEERS_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
        } break;

        case PM_EVT_ERROR_UNEXPECTED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
        } break;

        case PM_EVT_CONN_SEC_START:
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        case PM_EVT_PEER_DELETE_SUCCEEDED:
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
        default:
            break;
    }
}


/**@brief Function for performing battery measurement and updating the Battery Level characteristic
 *        in Battery Service.
 */
static void battery_level_update(void)
{
    uint32_t err_code;
    uint8_t  battery_level;

    battery_level = 98; //(uint8_t)sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

    err_code = ble_bas_battery_level_update(&m_bas, battery_level);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_NO_TX_PACKETS) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
}

static void voice_chip_output(uint8_t reg)
{
	SDAL;
	nrf_delay_ms(2);
	for(uint8_t i = 0; i < 8; i++)
	{
		SDAH;
		if(reg & 1){
			nrf_delay_us(1200);
			SDAL;
			nrf_delay_us(400);
		}else{
			nrf_delay_us(400);
			SDAL;
			nrf_delay_us(1200);
		}
		reg >>= 1;
	}
	SDAH;
//	nrf_gpio_pin_write(VOICE_CHIP_PIN, 0);
//	nrf_delay_ms(4);

//	for(int i = 0; i < reg; i++){
//		nrf_gpio_pin_write(VOICE_CHIP_PIN, 1);
//		nrf_delay_us(800);
//		nrf_gpio_pin_write(VOICE_CHIP_PIN, 0);
//		nrf_delay_us(2400);
//	}
//	nrf_gpio_pin_write(VOICE_CHIP_PIN, 1);
}	

static void ele_mach_contrl(uint8_t status)
{
	nrf_gpio_pin_write(ELE_MACH_PIN, 0);
	if(status == 1){
		nrf_gpio_pin_write(ELE_MACH_CONTRL_PIN1, 0);
		nrf_gpio_pin_write(ELE_MACH_CONTRL_PIN2, 1);	
	}else{
		nrf_gpio_pin_write(ELE_MACH_CONTRL_PIN1, 1);
		nrf_gpio_pin_write(ELE_MACH_CONTRL_PIN2, 0);	
	}
}

static void ele_mach_stop(void)
{
	nrf_gpio_pin_write(ELE_MACH_PIN, 1);
	nrf_gpio_pin_write(ELE_MACH_CONTRL_PIN1, 0);
	nrf_gpio_pin_write(ELE_MACH_CONTRL_PIN2, 0);
}

void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
	
				NRF_LOG_INFO("in_pin_handler_test pin = %d  %d %d\r\n",nrf_gpio_pin_read(3),nrf_gpio_pin_read(4),nrf_gpio_pin_read(22));
				NRF_LOG_FLUSH();
				
				if((nrf_gpio_pin_read(3) == 1) && (nrf_gpio_pin_read(4) == 1)  && (nrf_gpio_pin_read(22) == 1))
				{
					ele_mach_contrl(1);
					nrf_delay_ms(400);
					ele_mach_stop();
					lock_status.locklock = 1;
					lock_status.openlock = 0;
				}
}

void voice_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
	NRF_LOG_INFO("voice_pin_handler\r\n");
	NRF_LOG_FLUSH();
	
	static uint8_t i = 1;
	if(i < voice_count){
		i++;
		if (pdPASS != xTimerStart(m_voice_timer, OSTIMER_WAIT_FOR_QUEUE))
		{
			APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
		}
	}else{
		i = 1;
		nrf_gpio_pin_write(VOICE_MOSE_PIN, 1);
		ble_nus_string_send(&m_nus,(uint8_t *) "voice:accomplish", sizeof("voice:accomplish"));
	}
}

void in_pin_handler_test(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
	
				NRF_LOG_INFO("in_pin_handler_test pin = %d\r\n",pin);
				NRF_LOG_FLUSH();
	
	switch(pin){
		case 3:
			if( nrf_gpio_pin_read(MAC_CHECK_PIN1) == 1){
				NRF_LOG_INFO("MAC_CHECK_PIN1 HIGH\r\n");
				NRF_LOG_FLUSH();
			}
			else{
				NRF_LOG_INFO("MAC_CHECK_PIN1 LOW\r\n");
				NRF_LOG_FLUSH();
			}
			break;
		case 4:
		if( nrf_gpio_pin_read(MAC_CHECK_PIN2) == 1){
				NRF_LOG_INFO("MAC_CHECK_PIN2 HIGH\r\n");
			NRF_LOG_FLUSH();
			}
			else{
				NRF_LOG_INFO("MAC_CHECK_PIN2 LOW\r\n");
				NRF_LOG_FLUSH();
			}
			break;
		default:
			NRF_LOG_INFO("default ...!!!\r\n");
			break;		
	}

