flimmy78/MXN003_FACTORY/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/freertos_mxn003/main.c
static int cmd_analyse(cmd_data_struct * command)
{
	char        *data_ptr, split_ch = ',';
	int         cmd_Len, par_len;
	
	
	if(command == NULL || command->rcv_length < 1)
  {
        return -1;
  }
	//fun_toUpper(command->rcv_msg);
	data_ptr = &command->rcv_msg[command->position];//parse_sms_head(command->rcv_msg); 
	
	cmd_Len = strlen(data_ptr);
	

    if(data_ptr[cmd_Len - 3] == '#' && data_ptr[cmd_Len - 2] == 0x0D && data_ptr[cmd_Len - 1] == 0x0A)
    {
        data_ptr[cmd_Len - 3] = 0;
    }
    else if(data_ptr[cmd_Len - 2] == '#' && data_ptr[cmd_Len - 1] == 0x0D)
    {
        data_ptr[cmd_Len - 2] = 0;
    }
    else if(data_ptr[cmd_Len - 1] == '#')
    {
        data_ptr[cmd_Len - 1] = 0;
    }
			
		par_len = fun_str_analyse(data_ptr, command->pars, 20, NULL, "\r\n", split_ch);

    if(par_len > 20 || par_len <= 0)
    {
        return -1;
    }
		
		if(par_len > 20 || par_len <= 0)
    {
        return -1;
    }
		
		if((par_len - CM_Main) > 0)
    {
        command->part = par_len - CM_Main;
    }
    else
    {
        command->part = 0;
    }	

	return 1;
}

int8_t wait_reponse(char *desire_rep, uint16_t timeout)
{
	uint8_t tmp_tout = 0;
	uint8_t tmp_i = 0;
	uint8_t p;
	uint8_t str[30];
	while(1){
		while(NRF_SUCCESS != app_uart_get(&p)){
			//nrf_delay_ms(100);
//			tmp_tout ++;
//			if(tmp_tout > timeout)
//				return 2;
		}
		NRF_LOG_INFO("strxxx = %c\r\n",p);
		NRF_LOG_FLUSH();
		
		str[tmp_i] = p;
		tmp_i++;

		NRF_LOG_INFO("str[] = %s\r\n",(uint32_t)str);
		NRF_LOG_FLUSH();
		
		
		if((p == '\r') || (p == '\n')){
		NRF_LOG_INFO(" is r/r/n \r\n");
		NRF_LOG_FLUSH();
		}
		if(0 != strstr((char *)str,desire_rep)){
			return 1;
		}
	}
}


cmd_data_struct at_get_at_para(custom_cmdLine *commandBuffer_p)
{
		static cmd_data_struct at_cmd = {0};
		if(commandBuffer_p->length && (commandBuffer_p->length <(20)))
		{
			memset(&at_cmd, 0, sizeof(cmd_data_struct)); 
			memcpy(&at_cmd.rcv_msg, commandBuffer_p->character, commandBuffer_p->length);	

			at_cmd.rcv_length = commandBuffer_p->length;
			at_cmd.position   = commandBuffer_p->position;
			
			cmd_analyse(&at_cmd);
		}
		return at_cmd;
}


custom_rsp_type_enum custom_voice_func(custom_cmdLine *commandBuffer_p){
		custom_cmd_mode_enum result;
    custom_rsp_type_enum ret_value  = CUSTOM_RSP_ERROR;
    result = custom_find_cmd_mode(commandBuffer_p);
	
		cmd_data_struct cmd = at_get_at_para(commandBuffer_p);
		if(cmd.part != 2)
			return CUSTOM_RSP_ERROR;

		switch (result)
    {
				case CUSTOM_SET_OR_EXECUTE_MODE:
						voice_count = atoi(cmd.pars[1]);
						voice_class = atoi(cmd.pars[0]);
						ble_nus_string_send(&m_nus,(uint8_t *) "voice:start", sizeof("voice:start"));
						if (pdPASS != xTimerStart(m_voice_timer, OSTIMER_WAIT_FOR_QUEUE))
						{
							APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
						}
						ret_value = CUSTOM_RSP_OK;
						break;
        default:
            ret_value = CUSTOM_RSP_ERROR;
            break;
		}
		
		return ret_value;
}

void Delay(unsigned int nDelay)
{
	unsigned int i,j,k;
	for ( i=0;i<nDelay;i++ )
		for ( j=0;j<6144;j++ )
			k++;
}

int  uart_get_with_timeout(int32_t timeout_ms, char * rx_data, char *des_str)
{
    uint8_t i = 0, ch = 0;
    uint32_t err_code;

		int  ret = 1;
		do {
			err_code = app_uart_get(&ch);
			if (NRF_ERROR_NOT_FOUND == err_code)
			{
				if(timeout_ms-- > 0){
					Delay(1000);
				}else{
					return 2;
				}
			}
			else if (NRF_SUCCESS == err_code)   
			{
				rx_data[i++] = ch;
				if(strstr((const char *)rx_data,(const char *)des_str) != NULL){
				return 1;
				}
			}
			else
			{
				APP_ERROR_CHECK(err_code);
			}
		}
		while (1);
}
typedef struct blk_send_msg_tag{
	uint32_t start;
	uint32_t max_len;
	uint8_t  *pdata;
}blk_send_msg;

blk_send_msg g_send_msg;


uint32_t ble_send_data(uint8_t *pdata, uint32_t len){

		if (NULL == pdata || len <= 0){ return NRF_ERROR_INVALID_PARAM;}

		uint8_t temp_len;
    uint32_t err_code;
    g_send_msg.start = 0;
    g_send_msg.max_len = len;
    g_send_msg.pdata = pdata;
 
    temp_len = len>20 ? 20 : len;
		err_code = ble_nus_string_send(&m_nus, pdata, temp_len);
		if (NRF_SUCCESS == err_code){
			g_send_msg.start += temp_len;
		}
		return err_code;
}

uint32_t ble_send_more_data(void)
{
	uint32_t err_code;
	uint32_t dif_value;
	
	dif_value = g_send_msg.max_len - g_send_msg.start;
	if (0 == dif_value || NULL == g_send_msg.pdata){ return NRF_SUCCESS; }
	
	
	uint8_t temp_len;
	temp_len = dif_value>20 ? 20 : dif_value;
	err_code = ble_nus_string_send(&m_nus,g_send_msg.pdata + g_send_msg.start, temp_len);
	if (NRF_SUCCESS == err_code){
		g_send_msg.start += temp_len;
		return err_code;
	}
} 

int wait_data_reponse1(const char* msg, ...)
{
    va_list argp;
		char *p_data = NULL;
	
    int argno = 0;
    char *para;
		p_data = malloc(256);
		if(p_data == NULL){
			NRF_LOG_INFO("malloc fail!!!\r\n");
			return -1;
		}

		while(1){
			memset(p_data,0,256);
			get_uart_responese((uint8_t *)p_data);
			if(p_data[0] == 0){
				NRF_LOG_INFO("get buff null \r\n");
				NRF_LOG_FLUSH();
				ble_nus_string_send(&m_nus, (uint8_t *)"send_data_fail", strlen((char *)"send_data_fail"));
				free(p_data);
				p_data = NULL;
				break;
			}
			NRF_LOG_INFO("data-->%s\r\n",(uint32_t)p_data);
			NRF_LOG_FLUSH();
			
					va_start(argp, msg);
					if(strstr((const char *)p_data, (const char *)msg) != NULL){
						ble_send_data((uint8_t *)p_data,strlen((char *)p_data));
						free(p_data);
						p_data = NULL;
						va_end(argp);
						return 1;
					}
					while(1){
						para = va_arg(argp, char *);
						if(strcmp(para, "\0") == 0)
							break;
						if(strstr((const char *)p_data, (const char *)para) != NULL){
							ble_send_data((uint8_t *)p_data,strlen((char *)p_data));
							free(p_data);
							p_data = NULL;
							va_end(argp);
							return 1;
						}
					}
					va_end(argp);
			
		}
		free(p_data);
		p_data = NULL;
		return 1;
}

int wait_data_reponse(char *putdata1, char *putdata2, char * compardata1, char* compardata2)
{
		char *p_data = NULL;
		p_data = malloc(256);
		if(p_data == NULL){
			NRF_LOG_INFO("malloc fail!!!\r\n");
			return -1;
		}
	
		while(1){
			memset(p_data,0,256);
			get_uart_responese((uint8_t *)p_data);
			if(p_data[0] == 0){
				NRF_LOG_INFO("get buff null \r\n");
				NRF_LOG_FLUSH();
				ble_nus_string_send(&m_nus, (uint8_t *)"send_data_fail", strlen((char *)"send_data_fail"));
				free(p_data);
				p_data = NULL;
				break;
			}
			NRF_LOG_INFO("data-->%s\r\n",(uint32_t)p_data);
			NRF_LOG_FLUSH();
			
