flimmy78/MXN003_FACTORY/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/freertos_mxn003/main.c
			if(putdata1 == NULL){
				putdata1 = p_data;
			}
			if(putdata2 == NULL){
				putdata2 = p_data;
			}
			
					
			if(strstr((const char *)p_data, (const char *)compardata1) != NULL){
				
				ble_send_data((uint8_t *)putdata1,strlen((char *)putdata1));
//				int data_len =  strlen((char *)putdata1);
//				if(data_len <= 20){
//					ble_nus_string_send(&m_nus,(uint8_t *)putdata1, data_len);
//				}else{
//					ble_nus_string_send(&m_nus,(uint8_t *)putdata1, 20);
//					if(data_len - 20 <= 20){
//						ble_nus_string_send(&m_nus,(uint8_t *)putdata1+20, data_len - 20);
//					}else{
//						ble_nus_string_send(&m_nus,(uint8_t *)putdata1+20, 20);
//					}
//				}
				free(p_data);
				p_data = NULL;
				return 1;
			}else if(strstr((const char *)p_data, (const char *)compardata2) != NULL){
				ble_nus_string_send(&m_nus,(uint8_t *)putdata2, strlen((char *)putdata2));
				free(p_data);
				p_data = NULL;
				return 1;
			}
		}
		
		return 2;
}

custom_rsp_type_enum custom_mod_func(custom_cmdLine *commandBuffer_p){
		custom_cmd_mode_enum result;
    custom_rsp_type_enum ret_value  = CUSTOM_RSP_ERROR;
    result = custom_find_cmd_mode(commandBuffer_p);

	
		cmd_data_struct cmd = at_get_at_para(commandBuffer_p);
		if(cmd.part != 1)
			return CUSTOM_RSP_ERROR;
		uint8_t status = atoi(cmd.pars[0]);
		switch (result)
    {
				case CUSTOM_SET_OR_EXECUTE_MODE:
						if(1 == status){
							nrf_gpio_pin_write(MODME_CONTRL_PIN, 0);
							uart_onoff(1);	
							nrf_delay_ms(2000);
							wait_data_reponse1("+EUSIM:","\0");
							//wait_data_reponse1("+EUSIM: 1","\0")
							//uint8_t ret = wait_data_reponse("modem:open:sucess",NULL,"+EUSIM: 1",NULL);
//							if(ret == 1)
								ret_value = CUSTOM_RSP_OK;
//							else
//								ret_value = CUSTOM_RSP_ERROR;
						}else{
							uart_onoff(0);
							nrf_gpio_pin_write(MODME_CONTRL_PIN, 1);
							ble_nus_string_send(&m_nus, (uint8_t *)"modem:close:sucess", sizeof("modem:close:sucess"));
							ret_value = CUSTOM_RSP_OK;
						}
						break;
        default:
            ret_value = CUSTOM_RSP_ERROR;
            break;
		}
		
		return ret_value;	
}

custom_rsp_type_enum custom_modem_version_func(custom_cmdLine *commandBuffer_p){

			PutUARTBytes("AT+EVERN\r\n");
			nrf_delay_ms(100);
			wait_data_reponse1("_M","\0");
			//wait_data_reponse(NULL,NULL,"_M",NULL);
			return  CUSTOM_RSP_OK;
}

custom_rsp_type_enum custom_open_gps_func(custom_cmdLine *commandBuffer_p){
		PutUARTBytes("AT+EGPSON");
		nrf_delay_ms(100);
		wait_data_reponse1("OK","ERROR","\0");
//		wait_data_reponse("GPS:ON:SUCESS","GPS:ON:FAIL","OK","ERROR");	
		return  CUSTOM_RSP_OK;
}

custom_rsp_type_enum custom_close_gps_func(custom_cmdLine *commandBuffer_p){
		PutUARTBytes("AT+EGPSOFF");
		nrf_delay_ms(100);
		wait_data_reponse1("OK","ERROR","\0");
//		wait_data_reponse("GPS:OFF:SUCESS","GPS:OFF:FAIL","OK","ERROR");	
		return  CUSTOM_RSP_OK;
}

custom_rsp_type_enum custom_get_gps_data_func(custom_cmdLine *commandBuffer_p){
	PutUARTBytes("AT+EGPSGET");
	nrf_delay_ms(100);
	wait_data_reponse1("+LOC","NULL","ERROR","\0");
	//wait_data_reponse(NULL,NULL,"+LOC","NULL");	
	return  CUSTOM_RSP_OK;
}

custom_rsp_type_enum custom_gps_test_func(custom_cmdLine *commandBuffer_p){
	PutUARTBytes("AT+EGPSTEST");
	nrf_delay_ms(100);
	wait_data_reponse1("OK","ERROR","\0");
	//wait_data_reponse(NULL,NULL,"+LOC","NULL");	
	return  CUSTOM_RSP_OK;
}

custom_rsp_type_enum custom_gps_test_read_func(custom_cmdLine *commandBuffer_p){
	PutUARTBytes("AT+EGPSTESTR");
	nrf_delay_ms(100);
	wait_data_reponse1("SNR","ERROR","\0");
	//wait_data_reponse(NULL,NULL,"+LOC","NULL");	
	return  CUSTOM_RSP_OK;
}

custom_rsp_type_enum custom_check_epo_func(custom_cmdLine *commandBuffer_p){
	PutUARTBytes("AT+ECHECKEPO");
	nrf_delay_ms(100);
	wait_data_reponse1("OK","ERROR","\0");
	//wait_data_reponse(NULL,NULL,"+LOC","NULL");	
	return  CUSTOM_RSP_OK;
}

custom_rsp_type_enum custom_get_simn_func(custom_cmdLine *commandBuffer_p){
	PutUARTBytes("AT+ESIMSN");
	nrf_delay_ms(100);
	wait_data_reponse1("IMEI:","IMSI:","ERROR","\0");
	//wait_data_reponse(NULL,NULL,"+LOC","NULL");	
	return  CUSTOM_RSP_OK;
}

custom_rsp_type_enum custom_gsm_test_func(custom_cmdLine *commandBuffer_p){
	PutUARTBytes("AT+EGSMTEST");
	nrf_delay_ms(100);
	wait_data_reponse1("OK","ERROR","\0");
	//wait_data_reponse(NULL,NULL,"+LOC","NULL");	
	return  CUSTOM_RSP_OK;
}

custom_rsp_type_enum custom_gsm_test_read_func(custom_cmdLine *commandBuffer_p){
	PutUARTBytes("AT+EGSMTESTR");
	nrf_delay_ms(100);
	wait_data_reponse1("BEST","ERROR","\0");
	//wait_data_reponse(NULL,NULL,"+LOC","NULL");	
	return  CUSTOM_RSP_OK;
}



custom_rsp_type_enum custom_open_lock_func(custom_cmdLine *commandBuffer_p){


	if(lock_status.locklock != 1)
		return 1;
	
	ele_mach_contrl(1);
	
	nrf_delay_ms(3000);
	
	//////////////////
	ele_mach_contrl(0);
	while(1)
	{
		if(nrf_gpio_pin_read(22) == 0)
		{
			nrf_delay_ms(100);
			while(1)
			{
				if(nrf_gpio_pin_read(22) == 1){
					ele_mach_stop();
					lock_status.openlock = 1;
					lock_status.locklock = 0;
					lock_status.allowlock = 0;
					lock_status.controllock = 1;			
					return 1;
				}
			}	
		}
	}

	
	return  CUSTOM_RSP_OK;
}

custom_rsp_type_enum custom_permit_lock_func(custom_cmdLine *commandBuffer_p){

	//wait_data_reponse(NULL,NULL,"+LOC","NULL");	
	if((lock_status.controllock != 1) || (lock_status.openlock != 1))
		return 1;
	ele_mach_contrl(1);
	nrf_delay_ms(1000);
	
	ele_mach_stop();	
	lock_status.allowlock = 1;
	lock_status.controllock = 0;	
	return  CUSTOM_RSP_OK;
}

custom_rsp_type_enum custom_control_lock_func(custom_cmdLine *commandBuffer_p){

	//wait_data_reponse(NULL,NULL,"+LOC","NULL");	
	if((lock_status.allowlock != 1) || (lock_status.openlock != 1))
		return 1;
	ele_mach_contrl(0);
	while(1)
	{
		if(nrf_gpio_pin_read(22) == 0)
		{
			nrf_delay_ms(100);
			while(1)
			{
				if(nrf_gpio_pin_read(22) == 1){
					ele_mach_stop();
					lock_status.allowlock = 0;
					lock_status.controllock = 1;	
					return 1;
				}
			}	
		}
	}
	return  CUSTOM_RSP_OK;
}


